Beccaceci/LandTiger-Tetris-LPC1768/Source/timer/lib_timer.c
/*********************************************************************************************************
**--------------File Info---------------------------------------------------------------------------------
** File name:           lib_timer.h
** Last modified Date:  2014-09-25
** Last Version:        V1.00
** Descriptions:        atomic functions to be used by higher sw levels
** Correlated files:    lib_timer.c, funct_timer.c, IRQ_timer.c
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
#include "LPC17xx.h"
#include "timer.h"

/******************************************************************************
** Function name:		enable_timer
**
** Descriptions:		Enable timer
**
** parameters:			timer number: 0, 1, 2 or 3
** Returned value:		None
**
******************************************************************************/
void enable_timer(uint8_t timer_num) {
  	if (timer_num == 0)
			LPC_TIM0->TCR = 1;
  	else if (timer_num == 1)
			LPC_TIM1->TCR = 1;
  	else if (timer_num == 2)
			LPC_TIM2->TCR = 1;
		else if (timer_num == 3)
			LPC_TIM3->TCR = 1;
  	return;
}

/******************************************************************************
** Function name:		disable_timer
**
** Descriptions:		Disable timer
**
** parameters:			timer number: 0 or 1
** Returned value:		None
**
******************************************************************************/
void disable_timer(uint8_t timer_num) {
  	if (timer_num == 0)
			LPC_TIM0->TCR = 0;
  	else if (timer_num == 1)
			LPC_TIM1->TCR = 0;
		else if (timer_num == 2)
			LPC_TIM2->TCR = 0;
		else if (timer_num == 3)
			LPC_TIM3->TCR = 0;
  	return;
}

/******************************************************************************
** Function name:		reset_timer
**
** Descriptions:		Reset timer
**
** parameters:			timer number: 0, 1, 2 or 3
** Returned value:		None
**
******************************************************************************/
void reset_timer(uint8_t timer_num) {
  	uint32_t regVal;

  	if (timer_num == 0) {
			regVal = LPC_TIM0->TCR;
			regVal |= 0x02;
			LPC_TIM0->TCR = regVal;
		}
		else if (timer_num == 1) {
			regVal = LPC_TIM1->TCR;
			regVal |= 0x02;
			LPC_TIM1->TCR = regVal;
		}
		else if (timer_num == 2) {
			regVal = LPC_TIM2->TCR;
			regVal |= 0x02;
			LPC_TIM2->TCR = regVal;
		}
		else if (timer_num == 3) {
			regVal = LPC_TIM3->TCR;
			regVal |= 0x02;
			LPC_TIM3->TCR = regVal;
		}
		return;
}


/******************************************************************************
** Function name:       init_timer_PWM
**
** Descriptions:        Initialize Timer 2 or 3 for PWM usage (Exercise 1)
** Logic: LED ON at MR1, LED OFF at MR0 (Reset)
**
** parameters:          
** timer_num: 					2 or 3
** period: 							Total cycle time
** duty_cycle: 					Switch point
** Returned value:      1 if successful, 0 if invalid timer
******************************************************************************/
uint32_t init_timer (uint8_t timer_num, uint32_t TimerInterval) {
	if (timer_num == 0) {
		LPC_TIM0->MR0 = TimerInterval;
		LPC_TIM0->MCR = 3; // interrupt and reset MR0
		NVIC_EnableIRQ(TIMER0_IRQn);
		NVIC_SetPriority(TIMER0_IRQn, 2);
		return (1);
	}
	else if (timer_num == 1) {
		LPC_SC->PCONP |= (1 << 2); 
		
		LPC_TIM1->MR0 = TimerInterval;
		LPC_TIM1->MCR = 3;

		NVIC_EnableIRQ(TIMER1_IRQn);
		NVIC_SetPriority(TIMER1_IRQn, 1);
		return 1;
	}
	else if (timer_num == 2) {
		LPC_SC->PCONP |= (1 << 22);
		LPC_TIM2->MR0 = TimerInterval;

		LPC_TIM2->MCR = 3;

		NVIC_EnableIRQ(TIMER2_IRQn);
		NVIC_SetPriority(TIMER2_IRQn, 1);
		return 1;
	}
	else if (timer_num == 3) {
		LPC_SC->PCONP |= (1 << 23);
		LPC_TIM3->MR0 = TimerInterval;
		LPC_TIM3->MCR = 3;
		NVIC_EnableIRQ(TIMER3_IRQn);
		NVIC_SetPriority(TIMER2_IRQn, 1);
			return 1;
	}
	return 0;
} 

/******************************************************************************
**                            End Of File
******************************************************************************/
